[NeutralizeFieldCommander_var01 X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="找到外星指挥官"
ObjectiveTextPools[1]="击杀外星指挥官"
ObjectiveTextPools[2]="消灭所有敌方目标"
ObjectiveTextPools[3]="撤离所有XCOM士兵"

[NeutralizeFieldCommander_var01 X2MissionTemplate]
DisplayName="消灭外星指挥官"
Briefing="消灭外星指挥官"
PostMissionType="消灭外星指挥官"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="找到并消灭外星指挥官"
ObjectiveTextPools[1]="不要让外星指挥官逃脱"
+PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_A"
+PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_B"
+PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_C"

[GOp_FieldCommander_var01 X2MissionFlavorTextTemplate]
+FlavorText="MISSING FLAVOR TEXT"
+CouncilSpokesmanSuccessText="做得好，指挥官。您在 <XGParam:StrValue0/!WorldRegionName/> 消灭变种人原型操作的努力无疑是对敌人的重大打击。"
+CouncilSpokesmanFailureText="不幸的是，我们瞄准的 <XGParam:StrValue0/!WorldRegionName/> 的变种人原型已经从您的打击中逃脱。我们无法浪费这些机会，指挥官。"  

[ABASectoidGeneral X2CharacterTemplate]
+strCharacterName="外星指挥官"
+strAcquiredText="这就是我们来的目的。极端残忍地消灭。" 

[ABAViperGeneral X2CharacterTemplate]
+strCharacterName="外星指挥官"
+strAcquiredText="这就是我们来的目的。极端残忍地消灭。" 

[ABAMutonGeneral X2CharacterTemplate]
+strCharacterName="外星指挥官"
+strAcquiredText="这就是我们来的目的。极端残忍地消灭。" 

[ABAArchonGeneral X2CharacterTemplate]
+strCharacterName="外星指挥官"
+strAcquiredText="这就是我们来的目的。极端残忍地消灭。" 

[ABAAvatarGeneral X2CharacterTemplate]
+strCharacterName="外星指挥官"
+strAcquiredText="这就是我们来的目的。极端残忍地消灭。" 
